Revit 2027 API
RebarTrimExtendData.GetRebarUpdateCurvesData Method
 Gets a class that contains information used as input and output for rebar free form calculation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarUpdateCurvesData GetRebarUpdateCurvesData()
Public Function GetRebarUpdateCurvesData As RebarUpdateCurvesData
public:
RebarUpdateCurvesData^ GetRebarUpdateCurvesData()
member GetRebarUpdateCurvesData : unit -> RebarUpdateCurvesData
Return Value
RebarUpdateCurvesData
 Gets a class that contains information used as input and output for rebar free form calculation.
See Also
Reference
RebarTrimExtendData Class
Autodesk.Revit.DB.Structure Namespace